demo/sockets/examples/LAMMPS-OpenFOAM/textured_wall/openfoam/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0         0          0       )
    (152.39050 0          0       )
    (152.39050 25.3984    0       )
    (0         25.3984    0       )
    (0         0          38.09763)
    (152.39050 0          38.09763)
    (152.39050 25.3984    38.09763)
    (0         25.3984    38.09763)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (16 8 4) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    CPLReceiveMD
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    streamwiseIn
    {
        type cyclic;
        neighbourPatch streamwiseOut;
        faces
        (
            (0 4 7 3)
        );
    }
    streamwiseOut
    {
        type cyclic;
        neighbourPatch streamwiseIn;
        faces
        (
            (2 6 5 1)
        );
    }
    front
    {
        type cyclic;
        neighbourPatch back;
        faces
        (
            (0 3 2 1)
        );
    }
    back
    {
        type cyclic;
        neighbourPatch front;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
